<?php
// Heading
$_['heading_title']          = 'Атрибуты';

// Text
$_['text_success']           = 'Атрибуты успешно обновлены!';
$_['text_success_data']      = 'Данные успешно обновлены!';
$_['text_list']              = 'Список атрибутов';
$_['text_add']               = 'Добавление нового атрибута';
$_['text_edit']              = 'Редактирование атрибута';

// Column
$_['column_name']            = 'Название атрибута';
$_['column_attribute_group'] = 'Группа атрибута';
$_['column_sort_order']      = 'Порядок сортировки';
$_['column_action']          = 'Действие';

// Entry
$_['entry_name']             = 'Название атрибута';
$_['entry_attribute_group']  = 'Группа атрибута';
$_['entry_sort_order']       = 'Порядок сортировки';

// Error
$_['error_permission']       = 'Внимание: У Вас нет прав для управления атрибутами!';
$_['error_name']             = 'Название атрибута должно быть от 3 до 64 символов!';
$_['error_product']          = 'Внимание: Данный атрибут удалить невозможно, потому что он назначен %s товарам!';
$_['error_no_install']       = '<span class="text-danger">Внимание: Модуль волшебных редакторов не установлен! Редактирование возможно только стандартным редактором!</span>';
$_['error_no_activated']     = 'Внимание: Лицензия на право пользования волшебными редакторами не активирована, либо использован не легальный ключ активации!';
