<?php
// Heading
$_['heading_title']     = 'Группы атрибутов';

// Text
$_['text_success']      = 'Группы атрибутов успешно обновлены!';
$_['text_success_data'] = 'Данные успешно обновлены!';
$_['text_list']         = 'Список групп атрибутов';
$_['text_add']          = 'Лобавление новой группы атрибутов';
$_['text_edit']         = 'Редактирование группы атрибутов';

// Column
$_['column_name']       = 'Название группы атрибутов';
$_['column_sort_order'] = 'Порядок сортировки';
$_['column_action']     = 'Действие';

// Entry
$_['entry_name']        = 'Название группы атрибутов';
$_['entry_sort_order']  = 'Порядок сортировки';

// Error
$_['error_permission']  = 'Внимание: У Вас нет прав для управления группами атрибутов!';
$_['error_name']        = 'Название группы атрибутов должно быть от 3 до 64 символов!';
$_['error_attribute']   = 'Внимание: Данную группу атрибутов удалить невозможно, потому что она используется %s атрибутами!';
$_['error_product']     = 'Внимание: Данную группу атрибутов удалить невозможно, потому что она используется %s товарами!';
$_['error_no_install']  = '<span class="text-danger">Внимание: Модуль волшебных редакторов не установлен! Редактирование возможно только стандартным редактором!</span>';
$_['error_no_activated'] = 'Внимание: Лицензия на право пользования волшебными редакторами не активирована, либо использован не легальный ключ активации!';