<?php
// Heading
$_['heading_title']          = 'Категории';

// Text
$_['text_success']           = 'Категории обновлены!';
$_['text_list']              = 'Список категорий';
$_['text_add']               = 'Добавление категории';
$_['text_edit']              = 'Редактирование категории';
$_['text_default']           = 'По умолчанию';
$_['text_general']           = 'Общие данные';
$_['text_parent']            = 'Родительская категория';
$_['text_seo']           	 = 'SEO URL (ЧПУ)';
$_['text_filter']            = 'Фильтр';
$_['text_stores']            = 'Магазины, Столбцы';
$_['text_design']            = 'Дизайн';

// Column
$_['column_image']           = 'Изображение';
$_['column_name']            = 'Название категории';
$_['column_sort_order']      = 'Сортировка';
$_['column_top']             = 'Главное меню';
$_['column_status']          = 'Статус';
$_['column_action']          = 'Действие';

// Entry
$_['entry_name']             = 'Название категории';
$_['entry_description']      = 'Описание';
$_['entry_meta_title'] 	     = 'Метатег Title';
$_['entry_meta_h1'] 	     = 'Метатег H1';
$_['entry_meta_keyword']     = 'Ключевые слова';
$_['entry_meta_description'] = 'Метатег Описание';
$_['entry_keyword']          = 'SEO URL (ЧПУ)';
$_['entry_auto_keyword']     = 'Авто ЧПУ';
$_['entry_parent']           = 'Родительская категория';
$_['entry_filter']           = 'Фильтр';
$_['entry_store']            = 'Магазины';
$_['entry_image']            = 'Изображение';
$_['entry_top']              = 'Главное меню';
$_['entry_column']           = 'Столбцы';
$_['entry_sort_order']       = 'Порядок сортировки';
$_['entry_status']           = 'Статус';
$_['entry_layout']           = 'Схема';

// Help
$_['help_filter']            = 'Автозаполнение';
$_['help_keyword']           = 'Должен быть уникальным на всю систему. Запрещено использование пробелов. Допустимые символы - и _';
$_['help_auto_keyword']      = 'Автоматически создаст SEO URL (ЧПУ) по шаблону, заданному в SEO Менеджере.';
$_['help_top']               = 'Показывать в главном меню. Правило действительно только для главных (родительских) категорий.';
$_['help_column']            = 'Количество столбцов в выпадающем меню категории. Правило действительно только для главных (родительских) категорий.';

// Error
$_['error_warning']          = 'Внимание: Внимательно проверьте форму на ошибки!';
$_['error_permission']       = 'У Вас нет прав для управления категориями!';
$_['error_image']        	 = 'Новое изображение не выбрано!';
$_['error_name']             = 'Название категории должно быть от 2 до 32 символов!';
$_['error_meta_title']       = 'Метатег Title должен быть от 3 до 255 символов!';
$_['error_keyword']          = 'Такой SEO URL (ЧПУ) уже существует!';
$_['error_parent']           = 'Выбранная категория не может быть родительской сама себе!';
