<?php
// Heading
$_['heading_title']     = 'Фильтры';

// Text
$_['text_success']      = 'Фильтры успешно обновлены';
$_['text_success_data'] = 'Данные успешно обновлены!';
$_['text_list']         = 'Список фильтров';
$_['text_add']          = 'Добавление нового фильтра';
$_['text_edit']         = 'Редактирование фильтра';
$_['text_filter_value'] = 'Значения фильтра';

// Column
$_['column_group']      = 'Название группы фильтра';
$_['column_sort_order'] = 'Порядок сортировки';
$_['column_action']     = 'Действие';

// Entry
$_['entry_group']       = 'Название группы фильтра';
$_['entry_name']        = 'Значение фильтра';
$_['entry_sort_order']  = 'Порядок сортировки';

// Error
$_['error_permission']  = 'Внимание: У вас нет прав для управления фильтрами!';
$_['error_group']       = 'Название группы фильтра должно быть от 1 до 64 символов!';
$_['error_name']        = 'Значение фильтра должно быть от 1 до 64 символов!';
$_['error_no_install']  = '<span class="text-danger">Внимание: Модуль волшебных редакторов не установлен! Редактирование возможно только стандартным редактором!</span>';
$_['error_no_activated'] = 'Внимание: Лицензия на право пользования волшебными редакторами не активирована, либо использован не легальный ключ активации!';