<?php
// Heading
$_['heading_title']          = 'Информационные статьи';

// Text
$_['text_success']           = 'Информационные статьи успешно обновлены!';
$_['text_success_data']      = 'Данные успешно обновлены!';
$_['text_list']              = 'Список информационных статей';
$_['text_add']               = 'Добавление информационной статьи';
$_['text_edit']              = 'Редактирование информационной статьи';
$_['text_default']           = 'По умолчанию';
$_['text_general_data']      = 'Общие данные';
$_['text_seo_keyword']       = 'SEO URL (ЧПУ)';
$_['text_store']       		 = 'Магазины';
$_['text_design']       	 = 'Дизайн';

// Column
$_['column_title']           = 'Название статьи';
$_['column_sort_order']	     = 'Порядок сортировки';
$_['column_bottom']          = 'Низ сайта';
$_['column_status']          = 'Статус';
$_['column_action']          = 'Действие';

// Entry
$_['entry_title']            = 'Название статьи';
$_['entry_description']      = 'Текст статьи';
$_['entry_store']            = 'Магазины';
$_['entry_meta_title'] 	     = 'Метатег Title';
$_['entry_meta_h1'] 	     = 'Метатег H1';
$_['entry_meta_keyword'] 	 = 'Ключевые слова';
$_['entry_meta_description'] = 'Метатег Описание';
$_['entry_keyword']          = 'SEO URL (ЧПУ)';
$_['entry_auto_keyword']     = 'Авто ЧПУ';
$_['entry_bottom']           = 'Низ сайта';
$_['entry_status']           = 'Статус';
$_['entry_sort_order']       = 'Порядок сортировки';
$_['entry_layout']           = 'Схема';

// Help
$_['help_keyword']           = 'Должен быть уникальным на всю систему. Запрещено использование пробелов. Допустимые символы - и _';
$_['help_auto_keyword']      = 'Автоматически создаст SEO URL (ЧПУ) по шаблону, заданному в SEO Менеджере.';
$_['help_bottom']            = 'Показывать статью в низу сайта.';

// Error
$_['error_warning']          = 'Внимание: Внимательно проверьте форму на ошибки!';
$_['error_permission']       = 'Внимание: У Вас нет прав для управления информационными статьями!';
$_['error_title']            = 'Название статьи должно быть от 3 до 64 символов!';
$_['error_description']      = 'Текст статьи должен быть не менее 3 символов!';
$_['error_meta_title']       = 'Метатег Title должен быть от 3 до 255 символов!';
$_['error_keyword']          = 'Такой SEO URL (ЧПУ) уже существует!';
$_['error_account']          = 'Данную статью удалить невозможно, потому что она используется в качестве условий при регистрации нового покупателя!';
$_['error_checkout']         = 'Данную статью удалить невозможно, потому что она используется в качестве условий при оформлении заказа!';
$_['error_affiliate']        = 'Данную статью удалить невозможно, потому что она используется в качестве условий при регистрации нового партнера!';
$_['error_return']           = 'Данную статью удалить невозможно, потому что она используется в качестве условий при возврате товара!';
$_['error_store']            = 'Данную статью удалить невозможно, потому что она используется в %s магазинах!';