<?php
// Heading
$_['heading_title']     		= 'Производители';

// Text
$_['text_success']       		= 'Производители успешно обновлены!';
$_['text_success_data']  		= 'Данные успешно обновлены!';
$_['text_list']          		= 'Список производителей';
$_['text_add']           		= 'Добавление нового производителя';
$_['text_edit']          		= 'Редактирование производителя';
$_['text_default']       		= 'По умолчанию';
$_['text_percent']       		= 'Процент';
$_['text_amount']        		= 'Фиксированная сумма';
$_['text_general']           	= 'Общие данные';
$_['text_seo_keyword']   		= 'SEO URL (ЧПУ)';
$_['text_store']       	 		= 'Магазины';

// Column
$_['column_image']       		= 'Изображение';
$_['column_name']        		= 'Название производителя';
$_['column_sort_order']  		= 'Порядок сортировки';
$_['column_action']      		= 'Действие';

// Entry
$_['entry_name']         		= 'Название производителя';
$_['entry_description']      	= 'Описание';
$_['entry_meta_title'] 	     	= 'Метатег Title';
$_['entry_meta_h1'] 	     	= 'Метатег H1';
$_['entry_meta_description'] 	= 'Метатег Описание';
$_['entry_meta_keyword'] 	 	= 'Ключевые слова';
$_['entry_store']        		= 'Магазины';
$_['entry_keyword']      		= 'SEO URL (ЧПУ)';
$_['entry_auto_keyword'] 		= 'Авто ЧПУ';
$_['entry_image']        		= 'Изображение';
$_['entry_sort_order']   		= 'Порядок сортировки';
$_['entry_type']         		= 'Тип';

// Help
$_['help_keyword']      		= 'Должен быть уникальным на всю систему. Запрещено использование пробелов. Допустимые символы - и _';
$_['help_auto_keyword']  		= 'Автоматически создаст SEO URL (ЧПУ) по шаблону, заданному в SEO Менеджере.';

// Error
$_['error_warning']          	= 'Внимание: Внимательно проверьте форму на ошибки!';
$_['error_permission']   		= 'Внимание: У Вас нет прав для управления производителями!';
$_['error_image']        	 	= 'Новое изображение не выбрано!';
$_['error_name']         		= 'Название производителя должно быть от 2 до 64 символов!';
$_['error_meta_title']       	= 'Метатег Title должен быть от 3 до 255 символов!';
$_['error_keyword']      		= 'Такой SEO URL (ЧПУ) уже существует!';
$_['error_product']      		= 'Внимание: Выбранного производителя удалить невозможно, потому что он назначен к %s товару(ам)!';
