<?php
// Heading
$_['heading_title']       = 'Опции';

// Text
$_['text_success']        = 'Опции успешно обновлены!';
$_['text_success_data']   = 'Данные успешно обновлены!';
$_['text_list']           = 'Список опций';
$_['text_add']            = 'Добавление новой опции';
$_['text_edit']           = 'Редактирование опции';
$_['text_choose']         = 'Выбор';
$_['text_select']         = 'Список';
$_['text_radio']          = 'Переключатель';
$_['text_checkbox']       = 'Флажок';
$_['text_image']          = 'Изображение';
$_['text_input']          = 'Поля ввода';
$_['text_text']           = 'Текстовое поле';
$_['text_textarea']       = 'Текстовая область';
$_['text_file']           = 'Файл';
$_['text_date']           = 'Дата';
$_['text_datetime']       = 'Дата и время';
$_['text_time']           = 'Время';
$_['text_edit_value']     = 'Тип и значения опции';

// Column
$_['column_name']         = 'Название опции';
$_['column_sort_order']   = 'Порядок сортировки';
$_['column_action']       = 'Действие';

// Entry
$_['entry_name']          = 'Название опции';
$_['entry_type']          = 'Тип';
$_['entry_option_value']  = 'Значение опции';
$_['entry_image']         = 'Изображение';
$_['entry_sort_order']    = 'Порядок сортировки';

// Error
$_['error_permission']    = 'Внимание: У вас нет прав для управления опциями!';
$_['error_name']          = 'Название опции должно быть от 1 до 128 символов!';
$_['error_type']          = 'Не указан тип опции!';
$_['error_option_value']  = 'Значение опции должно быть от 1 до 128!';
$_['error_product']       = 'Внимание: Данную опцию удалить невозможно, потому что она присвоена %s товару(ам)!';
$_['error_no_install']    = '<span class="text-danger">Внимание: Модуль волшебных редакторов не установлен! Редактирование возможно только стандартным редактором!</span>';
$_['error_no_activated']  = 'Внимание: Лицензия на право пользования волшебными редакторами не активирована, либо использован не легальный ключ активации!';