<?php
$_['locale']                 				= 'ru-RU';

// Heading
$_['heading_title']          				= 'Товары';

// Text
$_['text_success']           				= 'Товары успешно обновлены!';
$_['text_success_data']      				= 'Данные успешно обновлены!';
$_['text_on']       		 				= '<span class="btn btn-success btn-sm"><i class="fa fa-check-circle"></i></span>';
$_['text_off']      		 				= '<span class="btn btn-danger btn-sm"><i class="fa fa-power-off"></i></span>';
$_['text_list']              				= 'Список товаров';
$_['text_add']               				= 'Добавление нового товара';
$_['text_edit']              				= 'Редактирование товара';
$_['text_default']           				= 'По умолчанию';
$_['text_option']            				= 'Опция';
$_['text_option_value']     	 			= 'Значение опции';
$_['text_percent']           				= 'Процент';
$_['text_amount']            				= 'Фиксированная сумма';
$_['text_add_filter']           			= 'Дополнительные фильтры';
$_['text_all_categories']    				= 'По всем категориям';
$_['text_all_brands']    	 				= 'По всем производителям';
$_['text_all_attributes']    				= 'По всем атрибутам';
$_['text_all_filters']    	 				= 'По всем фильтрам';
$_['text_no_category']    	 				= 'Товары без категорий';
$_['text_no_brand']    		 				= 'Товары без производителей';
$_['text_no_attribute']    	 				= 'Товары без атрибутов';
$_['text_no_filter']    	 				= 'Товары без фильтров';
$_['text_without']    	 	 				= ' --- Не назначено --- ';
$_['text_general']      	 				= 'Общие данные';
$_['text_code']      	 	 				= 'Артикулы';
$_['text_tax']      		 				= 'Расположение, Налоги';
$_['text_stock']      	 	 				= 'Минимальное кол-во, Склад, Доставка';
$_['text_seo']       		 				= 'SEO URL (ЧПУ)';
$_['text_size']    			 				= 'Размеры, Вес';
$_['text_show']      	 	 				= 'Показать';
$_['text_hide']      	 	 				= 'Скрыть';
$_['text_setting_mass_edit']      	 		= 'Настройки массового редактирования';
$_['text_mass_edit']      	 				= 'Массовое редактирование';
$_['text_setting_mass_delete']      	 	= 'Настройки массового удаления';
$_['text_mass_delete']       				= 'Массовое удаление';
$_['text_product_general']   				= 'Основные данные';
$_['text_product_data']      				= 'Данные товара';
$_['text_product_links']     				= 'Связи товара';
$_['text_product_sale']      				= 'Скидки и акции';
$_['text_add_discount']      				= 'Управление скидками';
$_['text_edit_discount']     				= 'Изменить актуальные скидки';
$_['text_add_special']       				= 'Управление акциями';
$_['text_edit_special']      				= 'Изменить актуальные акции';
$_['text_attr_option']       				= 'Атрибуты и Опции';
$_['text_images']     		 				= 'Изображения товара';
$_['text_other_data']        				= 'Прочие данные';
$_['text_date_available']   				= 'Дата поступления, Статус';
$_['text_sort_info']        				= 'Правило редактирования:<br /><ol><li>Если метод изменения "Равенство", тогда всем выбранным товарам будет будет присвоен порядок сортировки, который указан в поле "Значение".</li><li>Если метод изменения "Сортировка по порядку", тогда в поле "Значение" укажите стартовое число, от которого начинать порядок сортировки товаров. К каждому последующему товару будет добавлена единица.<br /><br /><b>Пример</b>: В поле "Значение" указано стартовое число 32. В результате у выбранных товаров получите следующий порядок сортировки:<ul><li>32;</li><li>33;</li><li>34</li><li>35;</li><li>и т.д.</li></ul></li></ol>';
$_['text_start']        					= 'Сортировка по порядку';
$_['text_image']   							= 'С изображением';
$_['text_not_image']   						= 'Без изображения';
$_['text_edit_items']   					= 'Общие настройки';
$_['text_edit_items_info']   				= 'Выберите данные, которые будут доступны при индивидуальном редактировании товара.';
$_['text_setting_data']   					= 'Данные товара';
$_['text_setting_hidden']   				= 'Скрытие данных';
$_['text_hide_data']   						= 'Выберите данные, которые будут скрыты в форме добавления/редактирования товара.';
$_['text_edit_mass_info']   				= 'Выберите данные, которые будут доступны при массовом редактировании товаров.';
$_['text_delete_mass_info']   				= 'Выберите данные, которые будут доступны для массового удаления.';
$_['text_seo_name']    						= 'Генерировать SEO URL (ЧПУ) на основе названия товара';
$_['text_seo_custom']    					= 'Генерировать SEO URL (ЧПУ) на основе указанного ниже';
$_['text_overwrite'] 						= 'Создать новые и перезаписать все существующие SEO URL (ЧПУ)';
$_['text_no_overwrite'] 					= 'Создать новые только для тех, которые не имеют SEO URL (ЧПУ)';
$_['text_seo_url_info']     				= '<ol><li>Генерировать SEO URL (ЧПУ) на основе названия товара - означает, что данные будут сгенерированы для каждого выбранного товара на основе его названия.</li><li>Генерировать SEO URL (ЧПУ) на основе указанного ниже - означает, что вы должны в ручную указать SEO URL (ЧПУ) и при генерации, чтобы не было дублей к каждому такому SEO URL (ЧПУ) будет добавлен порядковый номер.</li></ol>';
$_['text_generator_info']    				= 'Если заполнить данные в ручную, тогда у всех выбранных товаров данные будут созданы одинаковыми.<br />Если использовать генератор, тогда данные будут созданы уникальными для каждого выбранного товара.';
$_['text_rewrite_meta_title'] 				= 'Все существующие Meta Title будут перезаписаны. Вы уверены, что хотите продолжить?';
$_['text_rewrite_meta_h1'] 					= 'Все существующие Meta H1 будут перезаписаны. Вы уверены, что хотите продолжить?';
$_['text_rewrite_meta_description']			= 'Все существующие Meta Description будут перезаписаны. Вы уверены, что хотите продолжить?';
$_['text_rewrite_meta_keyword']				= 'Все существующие Meta Keyword будут перезаписаны. Вы уверены, что хотите продолжить?';
$_['text_rewrite_tags']						= 'Все существующие Теги товара будут перезаписаны. Вы уверены, что хотите продолжить?';
$_['text_edit_info']        				= 'Заполните нужные данные. Для сохранения данных отметьте их. Не отмеченные данные не сохраняются, даже если они заполнены.';
$_['text_edit_info_2']     					= 'Заполните нужные данные. Для сохранения данных отметьте их. Не отмеченные или не заполненные данные не сохраняются.';
$_['text_all_new']        					= 'Удалить все и добавить выбранное';
$_['text_add_selected']        				= 'Добавить к существующим выбранное';
$_['text_delete_selected']        			= 'Удалить из существующих выбранное';
$_['text_del_customer_group']        		= 'Удалить из существующих по указанной группе покупателей';
$_['text_del_quantity']        				= 'Удалить из существующих по указанному количеству';
$_['text_del_priority']        				= 'Удалить из существующих по указанному приоритету';
$_['text_del_price']        				= 'Удалить из существующих по указанной цене';
$_['text_del_date_start']        			= 'Удалить из существующих по указанной дате начала';
$_['text_del_date_end']        				= 'Удалить из существующих по указанной дате окончания';
$_['text_model']    			 			= 'Модель, Расположение, Налоги';
$_['text_minus']        					= 'Вычесть ( - )';
$_['text_plus']        						= 'Добавить ( + )';
$_['text_multiply']        					= 'Умножить ( * )';
$_['text_divide']        					= 'Разделить ( / )';
$_['text_equality']        					= 'Равенство ( = )';
$_['text_percent']        					= 'Процент';
$_['text_amount']        					= 'Фиксированная сумма';
$_['text_special_amount']    				= 'Цена = Указанное значение';
$_['text_price_plus_amount']    			= 'Цена = Цена товара + Значение';
$_['text_price_minus_amount']    			= 'Цена = Цена товара - Значение';
$_['text_price_plus_percent']    			= 'Цена = Цена товара + Процент';
$_['text_price_minus_percent']    			= 'Цена = Цена товара - Процент';
$_['text_shipping']        					= 'Склад, Доставка';
$_['text_amount_short']        				= 'Фикс. сумма';
$_['text_title_sale']         				= 'Заполните только те поля, данные которых должны быть изменены. Данные пустых полей не изменяются.';
$_['text_info_discount']         			= '<div class="text-info-discount"><br />
												<strong>Примеры:</strong>
												<ol>
													<li>Нужно в действующих скидках изменить только количество товаров и цену, для этого заполняете следующие поля:
														<ul>
															<li>Укаываете количество</li>
															<li>Выбираете метод изменения количества</li>
															<li>Выбираете метод изменения цены</li>
															<li>Указываете цену</li>
															<li>Выбираете тип изменения цены</li>
															<li>Остальные поля оставляете пустыми</li>
															<li>Нажимаете кнопку "Сохранить"</li>
														</ul>
														В результате у выбранных товаров в действующих скидках будет изменено только количество товаров и цена, остальные данные именены не будут.
													</li>
													<li>Нужно в действующих скидках изменить только даты начала и окончания скидок, для этого заполняете следующие поля:
														<ul>
															<li>Указываете новую дату начала</li>
															<li>Указываете новую дату окончания</li>
															<li>Остальные поля оставляете пустыми</li>
															<li>Нажимаете кнопку "Сохранить"</li>
														</ul>
														В результате у выбранных товаров в действующих скидках будут изменены только даты начала и окончания действия скидок, остальные данные именены не будут.
													</li>
													<li>и т.п.</li>
												</ol>
											  </div>';
$_['text_info_special']         			= '<div class="text-info-special"><br />
												<strong>Примеры:</strong>
												<ol>
													<li>Нужно в действующих акциях изменить только приоритет и цену акции, для этого заполняете следующие поля:
														<ul>
															<li>Укаываете приоритет</li>
															<li>Выбираете метод изменения приоритета</li>
															<li>Выбираете метод изменения цены</li>
															<li>Указываете цену</li>
															<li>Выбираете тип изменения цены</li>
															<li>Остальные поля оставляете пустыми</li>
															<li>Нажимаете кнопку "Сохранить"</li>
														</ul>
														В результате у выбранных товаров в действующих акциях будут изменены только приоритет и цена, остальные данные именены не будут.
													</li>
													<li>Нужно в действующих акциях изменить только даты начала и окончания акций, для этого заполняете следующие поля:
														<ul>
															<li>Указываете новую дату начала</li>
															<li>Указываете новую дату окончания</li>
															<li>Остальные поля оставляете пустыми</li>
															<li>Нажимаете кнопку "Сохранить"</li>
														</ul>
														В результате у выбранных товаров в действующих акциях будут изменены только даты начала и окончания действия акций, остальные данные именены не будут.
													</li>
													<li>и т.п.</li>
												</ol>
											  </div>';
											  
// Column
$_['column_image']           				= 'Изображение';
$_['column_name']            				= 'Название товара';
$_['column_category']        				= 'Категории';
$_['column_manufacturer']    				= 'Производитель';
$_['column_model']           				= 'Модель';
$_['column_price']           				= 'Цена';
$_['column_quantity']        				= 'Количество';
$_['column_sort_order']        				= 'Сортировка';
$_['column_status']          				= 'Статус';
$_['column_action']          				= 'Действие';

// Entry
$_['entry_name']             				= 'Название товара';
$_['entry_description']      				= 'Описание';
$_['entry_meta_title'] 	     				= 'Метатег Title';
$_['entry_meta_h1'] 	     				= 'Метатег H1';
$_['entry_meta_keyword'] 	 				= 'Ключевые слова';
$_['entry_meta_description'] 				= 'Метатег Описание';
$_['entry_auto_keyword']     				= 'Авто ЧПУ';
$_['entry_keyword']          				= 'SEO URL (ЧПУ)';
$_['entry_model']            				= 'Модель';
$_['entry_sku']              				= 'Артикул';
$_['entry_upc']              				= 'UPC';
$_['entry_ean']              				= 'EAN';
$_['entry_jan']              				= 'JAN';
$_['entry_isbn']             				= 'ISBN';
$_['entry_mpn']              				= 'MPN';
$_['entry_location']         				= 'Расположение';
$_['entry_shipping']         				= 'Требуется доставка';
$_['entry_manufacturer']     				= 'Производитель';
$_['entry_store']            				= 'Магазины';
$_['entry_date_available']   				= 'Дата поступления';
$_['entry_quantity']         				= 'Количество';
$_['entry_minimum']          				= 'Минимальное количество';
$_['entry_stock_status']     				= 'Остутствие на складе';
$_['entry_price']            				= 'Цена';
$_['entry_tax_class']        				= 'Налог';
$_['entry_points']           				= 'Баллы';
$_['entry_option_points']    				= 'Баллы';
$_['entry_subtract']         				= 'Вычитать со склада';
$_['entry_weight_class']     				= 'Единица измерения веса';
$_['entry_weight']           				= 'Вес';
$_['entry_dimension']        				= 'Размеры (Д x Ш x В)';
$_['entry_length_class']     				= 'Единица измерения длины';
$_['entry_length']           				= 'Длина';
$_['entry_width']            				= 'Ширина';
$_['entry_height']           				= 'Высота';
$_['entry_image']            				= 'Изображение';
$_['entry_additional_image'] 				= 'Дополнительные изоюражения';
$_['entry_customer_group']   				= 'Группа покупателей';
$_['entry_date_start']       				= 'Дата начала';
$_['entry_date_end']         				= 'Дата окончания';
$_['entry_priority']         				= 'Приоритет';
$_['entry_attribute']        				= 'Атрибут';
$_['entry_attribute_group']  				= 'Группа атрибутов';
$_['entry_text']             				= 'Текст';
$_['entry_option']           				= 'Опция';
$_['entry_option_value']     				= 'Значение опции';
$_['entry_required']         				= 'Требуется';
$_['entry_status']           				= 'Статус';
$_['entry_sort_order']       				= 'Порядок сортировки';
$_['entry_main_category']    				= 'Главная категория';
$_['entry_category']         				= 'Показывать в категориях';
$_['entry_categories']       				= 'Категория';
$_['entry_filter']           				= 'Фильтр';
$_['entry_download']        				= 'Загрузки';
$_['entry_related']          				= 'Рекомендуемые товары';
$_['entry_tag']          	 				= 'Теги товара';
$_['entry_reward']           				= 'Бонусные баллы';
$_['entry_layout']           				= 'Схема';
$_['entry_recurring']        				= 'Платежный профиль';
$_['entry_codes']        	 				= 'Коды';
$_['entry_size']        	 				= 'Размеры';
$_['entry_generator']     	 				= 'Генератор';
$_['entry_language']     	 				= 'Язык';
$_['entry_template']     					= 'Шаблон';
$_['entry_type_seo_url']     				= 'Тип генератора';
$_['entry_seo_url_suffix']     				= 'Окончание ЧПУ';
$_['entry_method_edit']     				= 'Метод изменения';
$_['entry_type_edit']     					= 'Тип изменения';
$_['entry_value_edit']     					= 'Значение';
$_['entry_apply_special']     				= 'Аналогично изменить действующие акции';
$_['entry_apply_discount']     				= 'Аналогично изменить действующие скидки';
$_['entry_start']     						= 'Стартовое число';
$_['entry_default_limit']     				= 'Лимит товаров';
$_['entry_hide']     						= 'Скрыть';

// Help
$_['help_auto_keyword']      				= 'Автоматически создаст SEO URL (ЧПУ) по шаблону, заданному в SEO Менеджере.';
$_['help_keyword']           				= 'Должен быть уникальным на всю систему. Запрещено использование пробелов. Допустимые символы - и _';
$_['help_sku']               				= 'Артикул';
$_['help_upc']               				= 'Универсальный код товара';
$_['help_ean']               				= 'Европейский артикул';
$_['help_jan']               				= 'Японский артикул';
$_['help_isbn']              				= 'Номер книги по международному стандарту';
$_['help_mpn']               				= 'Номер производителя';
$_['help_manufacturer']      				= 'Автозаполнение';
$_['help_minimum']           				= 'Минимальное количество товаров для заказа';
$_['help_stock_status']      				= 'Статус товара, когда его нет на складе';
$_['help_points']            				= 'Количество баллов для покупки товара. Поставьте 0, чтобы не использовать баллы.';
$_['help_category']          				= 'Автозаполнение';
$_['help_filter']            				= 'Автозаполнение';
$_['help_download']          				= 'Автозаполнение';
$_['help_related']           				= 'Автозаполнение';
$_['help_tag']          	 				= 'Укажите теги товара через запятую.';
$_['help_seo_suffix']     					= 'Данное поле заполнять только для стандартного типа ЧПУ \'SEO URL\', если же используйтся другой тип ЧПУ (SEO PRO и др.), то данное поле оставить пустым. Пример: .html';
$_['help_type_seo_url'] 					= 'Не рекомендуется применять тип генератора, перезаписывающий существующие \'SEO URL (ЧПУ)\' в рабочих магазинах, т.к. они возможно уже проиндексированы поисковыми роботами.';
$_['help_default_limit']          	 		= 'Количество товаров на странице';

// Error
$_['error_warning']          				= 'Внимание: Внимательно проверьте форму на ошибки!';
$_['error_permission']       				= 'Внимание: У Вас нет прав для управления товарами!';
$_['error_image']        	 				= 'Новое изображение не выбрано!';
$_['error_name']             				= 'Название товара должно быть от 3 до 255 символов!';
$_['error_meta_title']       				= 'Метатег Title должен быть от 3 до 255 символов!';
$_['error_model']            				= 'Модель товара должна быть от 1 до 64 символов!';
$_['error_keyword']          				= 'Такой SEO URL (ЧПУ) уже существует!';
$_['error_select_product'] 	 				= 'Необходимо выбрать хотя бы один товар!';
$_['error_by_zero'] 						= 'На ноль делить нельзя!';
$_['error_request_method']            		= 'Выберите метод изменения!';
$_['error_request_type']            		= 'Выберите тип изменения!';
$_['error_min_quantity'] 					= 'Минимальное количество должно быть больше нуля!';
$_['error_no_activated']     				= 'Внимание: Лицензия на право пользования CMS MaxyStore не активирована, либо использован не легальный ключ активации!';
