<?php
/*
 * Shoputils
 *
 * ПРИМЕЧАНИЕ К ЛИЦЕНЗИОННОМУ СОГЛАШЕНИЮ
 *
 * Этот файл связан лицензионным соглашением, которое можно найти в архиве,
 * вместе с этим файлом. Файл лицензии называется: LICENSE.2.3.x.RUS.TXT
 * Так же лицензионное соглашение можно найти по адресу:
 * https://opencart.market/LICENSE.2.3.x.RUS.TXT
 * 
 * =================================================================
 * OPENCART/ocStore 2.3.x ПРИМЕЧАНИЕ ПО ИСПОЛЬЗОВАНИЮ
 * =================================================================
 *  Этот файл предназначен для Opencart/ocStore 2.3.x. Shoputils не
 *  гарантирует правильную работу этого расширения на любой другой 
 *  версии Opencart/ocStore, кроме Opencart/ocStore 2.3.x. 
 *  Shoputils не поддерживает программное обеспечение для других 
 *  версий Opencart/ocStore.
 * =================================================================
*/
?>
{logo}<br /><br />

Уважаемый(я) {firstname} {lastname}!<br /><br />

Вы получили это письмо, так как был сделан запрос на изменение пароля Вашей учетной записи партнера в интернет-магазине {store}.<br /><br />

Если запрос был отправлен не Вами - зайдите в личный кабинет партнера по ссылке {account_link} и измените пароль на другой.<br /><br />

Ваш E-Mail: {email}<br />
Ваш новый пароль: {password}<br /><br />

С уважением, интернет-магазин {store}