<?php
/*
 * Shoputils
 *
 * ПРИМЕЧАНИЕ К ЛИЦЕНЗИОННОМУ СОГЛАШЕНИЮ
 *
 * Этот файл связан лицензионным соглашением, которое можно найти в архиве,
 * вместе с этим файлом. Файл лицензии называется: LICENSE.2.3.x.RUS.TXT
 * Так же лицензионное соглашение можно найти по адресу:
 * https://opencart.market/LICENSE.2.3.x.RUS.TXT
 * 
 * =================================================================
 * OPENCART/ocStore 2.3.x ПРИМЕЧАНИЕ ПО ИСПОЛЬЗОВАНИЮ
 * =================================================================
 *  Этот файл предназначен для Opencart/ocStore 2.3.x. Shoputils не
 *  гарантирует правильную работу этого расширения на любой другой 
 *  версии Opencart/ocStore, кроме Opencart/ocStore 2.3.x. 
 *  Shoputils не поддерживает программное обеспечение для других 
 *  версий Opencart/ocStore.
 * =================================================================
*/
?>
{logo}<br /><br />


{voucher_to_name}, Вы получили подарочный сертификат от {voucher_from_name} на сумму {voucher_amount}, которые можно использовать для покупок в нашем интернет-магзине {store}.<br /><br />

Комментарий от {voucher_from_name}:<br />
{voucher_message}<br /><br />

Как воспользоваться подарочным сертификатом?<br /><br />

Закажите товары, в нашем интернет-магазине, затем, при офрмлении заказа на странице просмотра корзины введите в поле "Введите код Сертификата" следующий код подарочного сертификата: <b>{voucher_code}</b><br /><br />

Напоминаем, что использовать подарочный сертификат Вы можете в любое удобное для Вас время.<br /><br />

Если у Вас есть какие-либо вопросы, ответьте на это сообщение.<br /><br />

Удачных покупок!<br /><br />

С уважением, интернет-магазин {store}