<?php
// Heading
$_['heading_title']       = 'Подсказки DaData PRO';

// Text
$_['text_module']         = 'Модули';
$_['text_success']        = "Модуль \"Подсказки DaData PRO\" успешно обновлен";
$_['text_not_installed'] = 'Модуль установлен неправильно! Для корректной работы переустановите модуль';

// Entry'
$_['entry_status']        = 'Статус:';
$_['entry_api']           = 'API-ключ:';
$_['entry_tips']          = 'Количество возвращаемых подсказок:';
$_['entry_geo']           = 'Автоопределение региона по ip (геолокация):';
$_['entry_additional']    = 'Показывать дополнительные поля адреса:';
$_['entry_gender']        = 'Показывать пол:';
$_['entry_citytype']      = 'Заполнять типы населенных пунктов:';

// Error
$_['error_permission']    = 'Внимание: Вы не имеете права модифицировать модуль "Подсказки DaData PRO"!';
$_['error_api']           = 'Необходимо заполнить поле API-ключ!';

$_['button_reinstall']='Переустановить';
?>