<?php
// Text
$_['text_instruction'] = 'Інструкція для оплати';
$_['text_description'] = 'Для оплати замовлення слідуйте наступній інструкції.';
$_['text_payment']     = 'Заказ буде опрацьований після того як ми отримаємо платіж.';

$_['error_description_zone']        = '<span style="color:red;">Цей спосіб оплати не доступний у вибраному регіоні.</span>';
$_['error_description_quantity']    = '<span style="color:red;">Цей спосіб оплати не доступний, тому що в замовлені є товари, яких немає на складі.</span>';
$_['error_description_total']       = '<span style="color:red;">Мін. вартість замовлення для цього способу оплати %s, щоб він став доступним, додайте в замовлення товари на суму %s</span>';

